Documents/ЗаказНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказНаПроизводство</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДТЧ</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОбеспеченияПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыОбеспеченияПотребности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриДостиженииТочкиЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрафику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказНаПроизводство/Ext/ManagerModule.bsl
Функция ВвестиНаОсновании(ДокОснование) Экспорт
	
	МассивДокументов = Новый Массив;
		
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПланПроизводства") Тогда
		ТЧМатериалов = ДокОснование.Сырье.Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланПроизводстваТовары.Спецификация.Цех КАК Цех,
		|	ПланПроизводстваТовары.Спецификация,
		|	ПланПроизводстваТовары.Номенклатура,
		|	ПланПроизводстваТовары.КоличествоКЗаказу КАК Количество
		|ИЗ
		|	Документ.ПланПроизводства.Товары КАК ПланПроизводстваТовары
		|ГДЕ
		|	ПланПроизводстваТовары.Ссылка = &Ссылка
		|	И ПланПроизводстваТовары.СпособОбеспечения = &СпособОбеспечения
		|	И ПланПроизводстваТовары.КоличествоКЗаказу > 0
		|ИТОГИ ПО
		|	Цех";
		Запрос.УстановитьПараметр("Ссылка", ДокОснование);
		Запрос.УстановитьПараметр("СпособОбеспечения", Перечисления.ТипыОбеспеченияПотребности.Производство);
		
		ВыборкаПоЦехам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоЦехам.Следующий() Цикл
			ДокЗаказа = Документы.ЗаказНаПроизводство.СоздатьДокумент();
			ДокЗаказа.Дата = ТекущаяДата();
			ДокЗаказа.Предприятие = ДокОснование.Предприятие;
			ДокЗаказа.Цех = ВыборкаПоЦехам.Цех;
			ДокЗаказа.Склад = ВыборкаПоЦехам.Цех.Склад;
			ДокЗаказа.ДокОснование = ДокОснование;
			ДокЗаказа.Подразделение = ДокОснование.Подразделение;
			ВыборкаПоНоменклатуре = ВыборкаПоЦехам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				СтрокаТЧНоменклатур = ДокЗаказа.ТабличнаяЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТЧНоменклатур, ВыборкаПоНоменклатуре);
				СтрокаТЧНоменклатур.УИД = Новый УникальныйИдентификатор;
				НайденныеСтрокиМатериалов = ТЧМатериалов.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧНоменклатур.Номенклатура));
				Для Каждого НайденнаяСтрокаМатериалов Из НайденныеСтрокиМатериалов Цикл
					СтрокаМатериалов = ДокЗаказа.Материалы.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаМатериалов, НайденнаяСтрокаМатериалов);
					СтрокаМатериалов.Материал = НайденнаяСтрокаМатериалов.Ингредиент;
					СтрокаМатериалов.УИДТЧ = СтрокаТЧНоменклатур.УИД;
				КонецЦикла;	
			КонецЦикла;
			ДокЗаказа.Записать();
			МассивДокументов.Добавить(ДокЗаказа.Ссылка);
		КонецЦикла;	
	КонецЕсли;	
	
	Возврат МассивДокументов;
	
КонецФункции
